posts/2011-03-17-sleep-deprivation.org
#+date: <2011-03-17>
#+filetags: teaching
#+title: Sleep Deprivation

This is for all my students who send me emails at 3:00 in the morning.


From Tony Schwarz's post titled "Sleep is More Important than Food" at the [[http://bit.ly/hC4REa][Harvard Business Review]]:


#+begin_quote


...In reality, the research suggests that even small amounts of sleep deprivation take a significant toll on our health, our mood, our cognitive capacity and our productivity.


Many of the effects we suffer are invisible. Insufficient sleep, for example, deeply impairs our ability to consolidate and stabilize learning that occurs during the waking day. In other words, it wreaks havoc on our memory.


#+end_quote

Sleep deprivation doesn't appear to be the best strategy to achieve a fulfilling educational experience. I have some grading to do, but I think I'll take a nap instead.



#+begin_tagline
Tagged: [[file:../tags/teaching.org][Teaching]]
#+end_tagline
