docs/posts/2011-03-17-sleep-deprivation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sleep Deprivation</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Sleep Deprivation</h1>
<p class="subtitle" role="doc-subtitle">Mar 17, 2011</p>
</header><p>
This is for all my students who send me emails at 3:00 in the morning.
</p>


<p>
From Tony Schwarz&rsquo;s post titled &ldquo;Sleep is More Important than Food&rdquo; at the <a href="http://bit.ly/hC4REa">Harvard Business Review</a>:
</p>


<blockquote>
<p>

</p>


<p>
&#x2026;In reality, the research suggests that even small amounts of sleep deprivation take a significant toll on our health, our mood, our cognitive capacity and our productivity.
</p>


<p>
Many of the effects we suffer are invisible. Insufficient sleep, for example, deeply impairs our ability to consolidate and stabilize learning that occurs during the waking day. In other words, it wreaks havoc on our memory.
</p>
</blockquote>

<p>
Sleep deprivation doesn&rsquo;t appear to be the best strategy to achieve a fulfilling educational experience. I have some grading to do, but I think I&rsquo;ll take a nap instead.
</p>



<div class="tagline" id="org6605d46">
<p>
Tagged: <a href="../tags/teaching.html">Teaching</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
